packages/gql/__test__/k6/metrics/k6-output-remote.txt
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: __test__/k6/scripts/load-test.ts
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 3m30s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✓ is status 200
     ✓ no errors

     checks.........................: 100.00% 223154 out of 223154
     data_received..................: 203 MB  1.1 MB/s
     data_sent......................: 45 MB   251 kB/s
   ✓ errors.........................: 0.00%   0 out of 0
     http_req_blocked...............: avg=3.63ms     min=0s       med=0s       max=1.41s    p(90)=1µs      p(95)=1µs     
     http_req_connecting............: avg=289.98µs   min=0s       med=0s       max=120.06ms p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=346.06ms   min=179.34ms med=363.01ms max=8.68s    p(90)=461.29ms p(95)=547.09ms
       { expected_response:true }...: avg=346.06ms   min=179.34ms med=363.01ms max=8.68s    p(90)=461.29ms p(95)=547.09ms
     http_req_failed................: 0.00%   0 out of 111577
     http_req_receiving.............: avg=10.33ms    min=4µs      med=82µs     max=121.12ms p(90)=29.85ms  p(95)=30.74ms 
     http_req_sending...............: avg=132.66µs   min=9µs      med=60µs     max=13.41ms  p(90)=242µs    p(95)=423.19µs
     http_req_tls_handshaking.......: avg=3.34ms     min=0s       med=0s       max=1.38s    p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=335.59ms   min=178.84ms med=344.3ms  max=8.68s    p(90)=450.95ms p(95)=536.61ms
     http_reqs......................: 111577  616.783504/s
     iteration_duration.............: avg=1.35s      min=1.17s    med=1.36s    max=9.68s    p(90)=1.47s    p(95)=1.58s   
     iterations.....................: 111577  616.783504/s
     query_token_prices.............: avg=355.153357 min=180      med=367      max=8683     p(90)=474.1    p(95)=600     
     query_top_tokens...............: avg=344.638832 min=181      med=361      max=1977     p(90)=467      p(95)=567     
     vus............................: 20      min=20               max=1000
     vus_max........................: 1000    min=1000             max=1000


running (3m00.9s), 0000/1000 VUs, 111577 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  3m0s